
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <title>File · GitBook</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.0">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="List.html" />
    
    
    <link rel="prev" href="Dictionary.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="Dictionary.html">
            
                <a href="Dictionary.html">
            
                    
                    Dictionary
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="File.html">
            
                <a href="File.html">
            
                    
                    File
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="List.html">
            
                <a href="List.html">
            
                    
                    List
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="Tuples.html">
            
                <a href="Tuples.html">
            
                    
                    Tuples
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="Numbers.html">
            
                <a href="Numbers.html">
            
                    
                    Numbers+
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="Strings.html">
            
                <a href="Strings.html">
            
                    
                    Strings+
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="ifstatement.html">
            
                <a href="ifstatement.html">
            
                    
                    if 条件语句+
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="loops.html">
            
                <a href="loops.html">
            
                    
                    循环语句+
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="Functions.html">
            
                <a href="Functions.html">
            
                    
                    函数+
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="Operators.html">
            
                <a href="Operators.html">
            
                    
                    运算符+
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.11" data-path="Time.html">
            
                <a href="Time.html">
            
                    
                    时间和日期
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.12" data-path="Module.html">
            
                <a href="Module.html">
            
                    
                    模块+
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.13" data-path="YiChangChuLi.html">
            
                <a href="YiChangChuLi.html">
            
                    
                    异常处理
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../module/">
            
                <a href="../module/">
            
                    
                    模块
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../module/BeautifulSoup.html">
            
                <a href="../module/BeautifulSoup.html">
            
                    
                    BeautifulSoup
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../module/cookielib.html">
            
                <a href="../module/cookielib.html">
            
                    
                    cookielib
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../module/pandas.html">
            
                <a href="../module/pandas.html">
            
                    
                    pandas
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../module/requests.html">
            
                <a href="../module/requests.html">
            
                    
                    requests
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../module/urllib.html">
            
                <a href="../module/urllib.html">
            
                    
                    urllib
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../module/urllib2.html">
            
                <a href="../module/urllib2.html">
            
                    
                    urllib2
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >File</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <!-- File.md --- 
;; 
;; Description: 
;; Author: Hongyi Wu(吴鸿毅)
;; Email: wuhongyi@qq.com 
;; Created: 日 6月 18 09:46:10 2017 (+0800)
;; Last-Updated: 二 6月 20 22:09:31 2017 (+0800)
;;           By: Hongyi Wu(吴鸿毅)
;;     Update #: 2
;; URL: http://wuhongyi.cn -->


<h1 id="file">File</h1><h2 id="open-&#x51FD;&#x6570;">open &#x51FD;&#x6570;</h2><p>&#x4F60;&#x5FC5;&#x987B;&#x5148;&#x7528;Python&#x5185;&#x7F6E;&#x7684;open()&#x51FD;&#x6570;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;file&#x5BF9;&#x8C61;&#xFF0C;&#x76F8;&#x5173;&#x7684;&#x65B9;&#x6CD5;&#x624D;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x5B83;&#x8FDB;&#x884C;&#x8BFB;&#x5199;&#x3002;
&#x8BED;&#x6CD5;&#xFF1A;</p><pre><code class="lang-python">file object = open(file_name [, access_mode][, buffering])</code></pre>
<p>&#x5404;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x7EC6;&#x8282;&#x5982;&#x4E0B;&#xFF1A;</p><ul><li>file_name&#xFF1A;file_name&#x53D8;&#x91CF;&#x662F;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x4F60;&#x8981;&#x8BBF;&#x95EE;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x3002;
</li>
<li>access_mode&#xFF1A;access_mode&#x51B3;&#x5B9A;&#x4E86;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7684;&#x6A21;&#x5F0F;&#xFF1A;&#x53EA;&#x8BFB;&#xFF0C;&#x5199;&#x5165;&#xFF0C;&#x8FFD;&#x52A0;&#x7B49;&#x3002;&#x6240;&#x6709;&#x53EF;&#x53D6;&#x503C;&#x89C1;&#x5982;&#x4E0B;&#x7684;&#x5B8C;&#x5168;&#x5217;&#x8868;&#x3002;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x975E;&#x5F3A;&#x5236;&#x7684;&#xFF0C;&#x9ED8;&#x8BA4;&#x6587;&#x4EF6;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x4E3A;&#x53EA;&#x8BFB;(r)&#x3002;
</li>
<li>buffering:&#x5982;&#x679C;buffering&#x7684;&#x503C;&#x88AB;&#x8BBE;&#x4E3A;0&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x5BC4;&#x5B58;&#x3002;&#x5982;&#x679C;buffering&#x7684;&#x503C;&#x53D6;1&#xFF0C;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x65F6;&#x4F1A;&#x5BC4;&#x5B58;&#x884C;&#x3002;&#x5982;&#x679C;&#x5C06;buffering&#x7684;&#x503C;&#x8BBE;&#x4E3A;&#x5927;&#x4E8E;1&#x7684;&#x6574;&#x6570;&#xFF0C;&#x8868;&#x660E;&#x4E86;&#x8FD9;&#x5C31;&#x662F;&#x7684;&#x5BC4;&#x5B58;&#x533A;&#x7684;&#x7F13;&#x51B2;&#x5927;&#x5C0F;&#x3002;&#x5982;&#x679C;&#x53D6;&#x8D1F;&#x503C;&#xFF0C;&#x5BC4;&#x5B58;&#x533A;&#x7684;&#x7F13;&#x51B2;&#x5927;&#x5C0F;&#x5219;&#x4E3A;&#x7CFB;&#x7EDF;&#x9ED8;&#x8BA4;&#x3002;
</li></ul>
<p>&#x4E0D;&#x540C;&#x6A21;&#x5F0F;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7684;&#x5B8C;&#x5168;&#x5217;&#x8868;&#xFF1A;</p><ul><li>r        &#x4EE5;&#x53EA;&#x8BFB;&#x65B9;&#x5F0F;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x3002;&#x6587;&#x4EF6;&#x7684;&#x6307;&#x9488;&#x5C06;&#x4F1A;&#x653E;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#x3002;&#x8FD9;&#x662F;&#x9ED8;&#x8BA4;&#x6A21;&#x5F0F;&#x3002;
</li>
<li>rb    &#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x53EA;&#x8BFB;&#x3002;&#x6587;&#x4EF6;&#x6307;&#x9488;&#x5C06;&#x4F1A;&#x653E;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#x3002;&#x8FD9;&#x662F;&#x9ED8;&#x8BA4;&#x6A21;&#x5F0F;&#x3002;
</li>
<li>r+    &#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x3002;&#x6587;&#x4EF6;&#x6307;&#x9488;&#x5C06;&#x4F1A;&#x653E;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#x3002;
</li>
<li>rb+    &#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x3002;&#x6587;&#x4EF6;&#x6307;&#x9488;&#x5C06;&#x4F1A;&#x653E;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#x3002;
</li>
<li>w        &#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x53EA;&#x7528;&#x4E8E;&#x5199;&#x5165;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#x5219;&#x5C06;&#x5176;&#x8986;&#x76D6;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x3002;
</li>
<li>wb    &#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x53EA;&#x7528;&#x4E8E;&#x5199;&#x5165;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#x5219;&#x5C06;&#x5176;&#x8986;&#x76D6;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x3002;
</li>
<li>w+    &#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#x5219;&#x5C06;&#x5176;&#x8986;&#x76D6;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x3002;
</li>
<li>wb+    &#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#x5219;&#x5C06;&#x5176;&#x8986;&#x76D6;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x3002;
</li>
<li>a        &#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x8FFD;&#x52A0;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#xFF0C;&#x6587;&#x4EF6;&#x6307;&#x9488;&#x5C06;&#x4F1A;&#x653E;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x7ED3;&#x5C3E;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x5C06;&#x4F1A;&#x88AB;&#x5199;&#x5165;&#x5230;&#x5DF2;&#x6709;&#x5185;&#x5BB9;&#x4E4B;&#x540E;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x5199;&#x5165;&#x3002;
</li>
<li>ab    &#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x8FFD;&#x52A0;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#xFF0C;&#x6587;&#x4EF6;&#x6307;&#x9488;&#x5C06;&#x4F1A;&#x653E;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x7ED3;&#x5C3E;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x5C06;&#x4F1A;&#x88AB;&#x5199;&#x5165;&#x5230;&#x5DF2;&#x6709;&#x5185;&#x5BB9;&#x4E4B;&#x540E;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x5199;&#x5165;&#x3002;
</li>
<li>a+    &#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#xFF0C;&#x6587;&#x4EF6;&#x6307;&#x9488;&#x5C06;&#x4F1A;&#x653E;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x7ED3;&#x5C3E;&#x3002;&#x6587;&#x4EF6;&#x6253;&#x5F00;&#x65F6;&#x4F1A;&#x662F;&#x8FFD;&#x52A0;&#x6A21;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x3002;
</li>
<li>ab+    &#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x8FFD;&#x52A0;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#xFF0C;&#x6587;&#x4EF6;&#x6307;&#x9488;&#x5C06;&#x4F1A;&#x653E;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x7ED3;&#x5C3E;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x3002;
</li></ul>
<p><em>File&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;</em></p><p>&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x88AB;&#x6253;&#x5F00;&#x540E;&#xFF0C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;file&#x5BF9;&#x8C61;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6709;&#x5173;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x5404;&#x79CD;&#x4FE1;&#x606F;&#x3002;</p><p>&#x4EE5;&#x4E0B;&#x662F;&#x548C;file&#x5BF9;&#x8C61;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x5C5E;&#x6027;&#x7684;&#x5217;&#x8868;&#xFF1A;</p><ul><li>file.closed    &#x8FD4;&#x56DE;true&#x5982;&#x679C;&#x6587;&#x4EF6;&#x5DF2;&#x88AB;&#x5173;&#x95ED;&#xFF0C;&#x5426;&#x5219;&#x8FD4;&#x56DE;false&#x3002;
</li>
<li>file.mode        &#x8FD4;&#x56DE;&#x88AB;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7684;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x3002;
</li>
<li>file.name        &#x8FD4;&#x56DE;&#x6587;&#x4EF6;&#x7684;&#x540D;&#x79F0;&#x3002;
</li>
<li>file.softspace    &#x5982;&#x679C;&#x7528;print&#x8F93;&#x51FA;&#x540E;&#xFF0C;&#x5FC5;&#x987B;&#x8DDF;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x7B26;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;false&#x3002;&#x5426;&#x5219;&#x8FD4;&#x56DE;true&#x3002;
</li></ul>
<h2 id="close&#x65B9;&#x6CD5;">close()&#x65B9;&#x6CD5;</h2><p>File &#x5BF9;&#x8C61;&#x7684; close&#xFF08;&#xFF09;&#x65B9;&#x6CD5;&#x5237;&#x65B0;&#x7F13;&#x51B2;&#x533A;&#x91CC;&#x4EFB;&#x4F55;&#x8FD8;&#x6CA1;&#x5199;&#x5165;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x5173;&#x95ED;&#x8BE5;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E4B;&#x540E;&#x4FBF;&#x4E0D;&#x80FD;&#x518D;&#x8FDB;&#x884C;&#x5199;&#x5165;&#x3002;</p><p>&#x5F53;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x88AB;&#x91CD;&#x65B0;&#x6307;&#x5B9A;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;Python &#x4F1A;&#x5173;&#x95ED;&#x4E4B;&#x524D;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x7528; close&#xFF08;&#xFF09;&#x65B9;&#x6CD5;&#x5173;&#x95ED;&#x6587;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4E60;&#x60EF;&#x3002;</p><p>&#x8BED;&#x6CD5;&#xFF1A;</p><pre><code class="lang-python">fileObject.close();</code></pre>
<h2 id="write&#x65B9;&#x6CD5;">write()&#x65B9;&#x6CD5;</h2><p>write()&#x65B9;&#x6CD5;&#x53EF;&#x5C06;&#x4EFB;&#x4F55;&#x5B57;&#x7B26;&#x4E32;&#x5199;&#x5165;&#x4E00;&#x4E2A;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x9700;&#x8981;&#x91CD;&#x70B9;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;Python&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4EE5;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EC5;&#x4EC5;&#x662F;&#x6587;&#x5B57;&#x3002;</p><p>write()&#x65B9;&#x6CD5;&#x4E0D;&#x4F1A;&#x5728;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x7ED3;&#x5C3E;&#x6DFB;&#x52A0;&#x6362;&#x884C;&#x7B26;(&apos;\n&apos;)&#xFF1A;</p><p>&#x8BED;&#x6CD5;&#xFF1A;</p><pre><code class="lang-python">fileObject.write(string);</code></pre>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x88AB;&#x4F20;&#x9012;&#x7684;&#x53C2;&#x6570;&#x662F;&#x8981;&#x5199;&#x5165;&#x5230;&#x5DF2;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x3002;</p><p>write() &#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x5411;&#x6587;&#x4EF6;&#x4E2D;&#x5199;&#x5165;&#x6307;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#x3002;
&#x5728;&#x6587;&#x4EF6;&#x5173;&#x95ED;&#x524D;&#x6216;&#x7F13;&#x51B2;&#x533A;&#x5237;&#x65B0;&#x524D;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x5185;&#x5BB9;&#x5B58;&#x50A8;&#x5728;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#xFF0C;&#x8FD9;&#x65F6;&#x4F60;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x662F;&#x770B;&#x4E0D;&#x5230;&#x5199;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x7684;&#x3002;</p><h2 id="read&#x65B9;&#x6CD5;">read()&#x65B9;&#x6CD5;</h2><p>read&#xFF08;&#xFF09;&#x65B9;&#x6CD5;&#x4ECE;&#x4E00;&#x4E2A;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x9700;&#x8981;&#x91CD;&#x70B9;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;Python&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4EE5;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EC5;&#x4EC5;&#x662F;&#x6587;&#x5B57;&#x3002;</p><p>&#x8BED;&#x6CD5;&#xFF1A;</p><pre><code class="lang-python">fileObject.read([count]);</code></pre>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x88AB;&#x4F20;&#x9012;&#x7684;&#x53C2;&#x6570;&#x662F;&#x8981;&#x4ECE;&#x5DF2;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x8282;&#x8BA1;&#x6570;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x4ECE;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#x5F00;&#x59CB;&#x8BFB;&#x5165;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4F20;&#x5165;count&#xFF0C;&#x5B83;&#x4F1A;&#x5C1D;&#x8BD5;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x8BFB;&#x53D6;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x76F4;&#x5230;&#x6587;&#x4EF6;&#x7684;&#x672B;&#x5C3E;&#x3002;</p><h2 id="&#x6587;&#x4EF6;&#x5B9A;&#x4F4D;">&#x6587;&#x4EF6;&#x5B9A;&#x4F4D;</h2><p>tell()&#x65B9;&#x6CD5;&#x544A;&#x8BC9;&#x4F60;&#x6587;&#x4EF6;&#x5185;&#x7684;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#xFF1B;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E0B;&#x4E00;&#x6B21;&#x7684;&#x8BFB;&#x5199;&#x4F1A;&#x53D1;&#x751F;&#x5728;&#x6587;&#x4EF6;&#x5F00;&#x5934;&#x8FD9;&#x4E48;&#x591A;&#x5B57;&#x8282;&#x4E4B;&#x540E;&#x3002;</p><p>seek&#xFF08;offset [,from]&#xFF09;&#x65B9;&#x6CD5;&#x6539;&#x53D8;&#x5F53;&#x524D;&#x6587;&#x4EF6;&#x7684;&#x4F4D;&#x7F6E;&#x3002;Offset&#x53D8;&#x91CF;&#x8868;&#x793A;&#x8981;&#x79FB;&#x52A8;&#x7684;&#x5B57;&#x8282;&#x6570;&#x3002;From&#x53D8;&#x91CF;&#x6307;&#x5B9A;&#x5F00;&#x59CB;&#x79FB;&#x52A8;&#x5B57;&#x8282;&#x7684;&#x53C2;&#x8003;&#x4F4D;&#x7F6E;&#x3002;
&#x5982;&#x679C;from&#x88AB;&#x8BBE;&#x4E3A;0&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5C06;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#x4F5C;&#x4E3A;&#x79FB;&#x52A8;&#x5B57;&#x8282;&#x7684;&#x53C2;&#x8003;&#x4F4D;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x4E3A;1&#xFF0C;&#x5219;&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x7684;&#x4F4D;&#x7F6E;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;&#x4F4D;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x5B83;&#x88AB;&#x8BBE;&#x4E3A;2&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x672B;&#x5C3E;&#x5C06;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;&#x4F4D;&#x7F6E;&#x3002;</p><p>&#x4F8B;&#x5B50;&#xFF1A;</p><pre><code class="lang-python"><span class="hljs-comment">#!/usr/bin/python</span>
<span class="hljs-comment"># -*- coding: UTF-8 -*-</span>

<span class="hljs-comment"># &#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;</span>
fo = open(<span class="hljs-string">&quot;foo.txt&quot;</span>, <span class="hljs-string">&quot;r+&quot;</span>)
str = fo.read(<span class="hljs-number">10</span>);
<span class="hljs-keyword">print</span> <span class="hljs-string">&quot;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x662F; : &quot;</span>, str

<span class="hljs-comment"># &#x67E5;&#x627E;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;</span>
position = fo.tell();
<span class="hljs-keyword">print</span> <span class="hljs-string">&quot;&#x5F53;&#x524D;&#x6587;&#x4EF6;&#x4F4D;&#x7F6E; : &quot;</span>, position

<span class="hljs-comment"># &#x628A;&#x6307;&#x9488;&#x518D;&#x6B21;&#x91CD;&#x65B0;&#x5B9A;&#x4F4D;&#x5230;&#x6587;&#x4EF6;&#x5F00;&#x5934;</span>
position = fo.seek(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>);
str = fo.read(<span class="hljs-number">10</span>);
<span class="hljs-keyword">print</span> <span class="hljs-string">&quot;&#x91CD;&#x65B0;&#x8BFB;&#x53D6;&#x5B57;&#x7B26;&#x4E32; : &quot;</span>, str
<span class="hljs-comment"># &#x5173;&#x95ED;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;</span>
fo.close()</code></pre>
<hr><h2 id="&#x91CD;&#x547D;&#x540D;&#x548C;&#x5220;&#x9664;&#x6587;&#x4EF6;">&#x91CD;&#x547D;&#x540D;&#x548C;&#x5220;&#x9664;&#x6587;&#x4EF6;</h2><p>Python&#x7684;os&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x4E86;&#x5E2E;&#x4F60;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x91CD;&#x547D;&#x540D;&#x548C;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x3002;</p><p>&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5148;&#x5BFC;&#x5165;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x76F8;&#x5173;&#x7684;&#x5404;&#x79CD;&#x529F;&#x80FD;&#x3002;</p><p>rename()&#x65B9;&#x6CD5;&#xFF1A;</p><p>rename()&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5F53;&#x524D;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x548C;&#x65B0;&#x6587;&#x4EF6;&#x540D;&#x3002;</p><p>&#x8BED;&#x6CD5;&#xFF1A;</p><pre><code class="lang-python">os.rename(current_file_name, new_file_name)</code></pre>
<p>&#x4F8B;&#x5B50;&#xFF1A;
&#x4E0B;&#x4F8B;&#x5C06;&#x91CD;&#x547D;&#x540D;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x6587;&#x4EF6;test1.txt&#x3002;</p><pre><code class="lang-python"><span class="hljs-comment">#!/usr/bin/python</span>
<span class="hljs-comment"># -*- coding: UTF-8 -*-</span>

<span class="hljs-keyword">import</span> os

<span class="hljs-comment"># &#x91CD;&#x547D;&#x540D;&#x6587;&#x4EF6;test1.txt&#x5230;test2.txt&#x3002;</span>
os.rename( <span class="hljs-string">&quot;test1.txt&quot;</span>, <span class="hljs-string">&quot;test2.txt&quot;</span> )</code></pre>
<p><em>remove()&#x65B9;&#x6CD5;</em></p><p>&#x4F60;&#x53EF;&#x4EE5;&#x7528;remove()&#x65B9;&#x6CD5;&#x5220;&#x9664;&#x6587;&#x4EF6;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x8981;&#x5220;&#x9664;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;</p><p>&#x8BED;&#x6CD5;&#xFF1A;</p><pre><code class="lang-python">os.remove(file_name)
&#x4F8B;&#x5B50;&#xFF1A;
&#x4E0B;&#x4F8B;&#x5C06;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x6587;&#x4EF6;test2.txt&#x3002;
<span class="hljs-comment">#!/usr/bin/python</span>
<span class="hljs-comment"># -*- coding: UTF-8 -*-</span>

<span class="hljs-keyword">import</span> os

<span class="hljs-comment"># &#x5220;&#x9664;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x6587;&#x4EF6;test2.txt</span>
os.remove(<span class="hljs-string">&quot;test2.txt&quot;</span>)
```python

<span class="hljs-comment">## Python&#x91CC;&#x7684;&#x76EE;&#x5F55;</span>

&#x6240;&#x6709;&#x6587;&#x4EF6;&#x90FD;&#x5305;&#x542B;&#x5728;&#x5404;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x4E0D;&#x8FC7;Python&#x4E5F;&#x80FD;&#x8F7B;&#x677E;&#x5904;&#x7406;&#x3002;os&#x6A21;&#x5757;&#x6709;&#x8BB8;&#x591A;&#x65B9;&#x6CD5;&#x80FD;&#x5E2E;&#x4F60;&#x521B;&#x5EFA;&#xFF0C;&#x5220;&#x9664;&#x548C;&#x66F4;&#x6539;&#x76EE;&#x5F55;&#x3002;

*mkdir()&#x65B9;&#x6CD5;*

&#x53EF;&#x4EE5;&#x4F7F;&#x7528;os&#x6A21;&#x5757;&#x7684;mkdir()&#x65B9;&#x6CD5;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x76EE;&#x5F55;&#x4EEC;&#x3002;&#x4F60;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x8981;&#x521B;&#x5EFA;&#x7684;&#x76EE;&#x5F55;&#x540D;&#x79F0;&#x7684;&#x53C2;&#x6570;&#x3002;
&#x8BED;&#x6CD5;&#xFF1A;
```python
os.mkdir(<span class="hljs-string">&quot;newdir&quot;</span>)
```python
&#x4F8B;&#x5B50;&#xFF1A;
&#x4E0B;&#x4F8B;&#x5C06;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x76EE;&#x5F55;test&#x3002;
```python
<span class="hljs-comment">#!/usr/bin/python</span>
<span class="hljs-comment"># -*- coding: UTF-8 -*-</span>

<span class="hljs-keyword">import</span> os

<span class="hljs-comment"># &#x521B;&#x5EFA;&#x76EE;&#x5F55;test</span>
os.mkdir(<span class="hljs-string">&quot;test&quot;</span>)</code></pre>
<p><em>chdir()&#x65B9;&#x6CD5;</em></p><p>&#x53EF;&#x4EE5;&#x7528;chdir()&#x65B9;&#x6CD5;&#x6765;&#x6539;&#x53D8;&#x5F53;&#x524D;&#x7684;&#x76EE;&#x5F55;&#x3002;chdir()&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x4F60;&#x60F3;&#x8BBE;&#x6210;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x7684;&#x76EE;&#x5F55;&#x540D;&#x79F0;&#x3002;</p><p>&#x8BED;&#x6CD5;&#xFF1A;</p><pre><code class="lang-python">os.chdir(<span class="hljs-string">&quot;newdir&quot;</span>)</code></pre>
<p>&#x4F8B;&#x5B50;&#xFF1A;
&#x4E0B;&#x4F8B;&#x5C06;&#x8FDB;&#x5165;&quot;/home/newdir&quot;&#x76EE;&#x5F55;&#x3002;</p><pre><code class="lang-python"><span class="hljs-comment">#!/usr/bin/python</span>
<span class="hljs-comment"># -*- coding: UTF-8 -*-</span>

<span class="hljs-keyword">import</span> os

<span class="hljs-comment"># &#x5C06;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x6539;&#x4E3A;&quot;/home/newdir&quot;</span>
os.chdir(<span class="hljs-string">&quot;/home/newdir&quot;</span>)</code></pre>
<p><em>getcwd()&#x65B9;&#x6CD5;</em></p><p>getcwd()&#x65B9;&#x6CD5;&#x663E;&#x793A;&#x5F53;&#x524D;&#x7684;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x3002;</p><p>&#x8BED;&#x6CD5;&#xFF1A;</p><pre><code class="lang-python">os.getcwd()</code></pre>
<p>&#x4F8B;&#x5B50;&#xFF1A;</p><p>&#x4E0B;&#x4F8B;&#x7ED9;&#x51FA;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#xFF1A;</p><pre><code class="lang-python"><span class="hljs-comment">#!/usr/bin/python</span>
<span class="hljs-comment"># -*- coding: UTF-8 -*-</span>

<span class="hljs-keyword">import</span> os

<span class="hljs-comment"># &#x7ED9;&#x51FA;&#x5F53;&#x524D;&#x7684;&#x76EE;&#x5F55;</span>
<span class="hljs-keyword">print</span> os.getcwd()</code></pre>
<p><em>rmdir()&#x65B9;&#x6CD5;</em></p><p>rmdir()&#x65B9;&#x6CD5;&#x5220;&#x9664;&#x76EE;&#x5F55;&#xFF0C;&#x76EE;&#x5F55;&#x540D;&#x79F0;&#x4EE5;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x3002;</p><p>&#x5728;&#x5220;&#x9664;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x5E94;&#x8BE5;&#x5148;&#x88AB;&#x6E05;&#x9664;&#x3002;</p><p>&#x8BED;&#x6CD5;&#xFF1A;</p><pre><code class="lang-python">os.rmdir(<span class="hljs-string">&apos;dirname&apos;</span>)</code></pre>
<p>&#x4F8B;&#x5B50;&#xFF1A;</p><p>&#x4EE5;&#x4E0B;&#x662F;&#x5220;&#x9664;&quot; /tmp/test&quot;&#x76EE;&#x5F55;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x76EE;&#x5F55;&#x7684;&#x5B8C;&#x5168;&#x5408;&#x89C4;&#x7684;&#x540D;&#x79F0;&#x5FC5;&#x987B;&#x88AB;&#x7ED9;&#x51FA;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x641C;&#x7D22;&#x8BE5;&#x76EE;&#x5F55;&#x3002;</p><pre><code class="lang-python"><span class="hljs-comment">#!/usr/bin/python</span>
<span class="hljs-comment"># -*- coding: UTF-8 -*-</span>

<span class="hljs-keyword">import</span> os

<span class="hljs-comment"># &#x5220;&#x9664;&#x201D;/tmp/test&#x201D;&#x76EE;&#x5F55;</span>
os.rmdir( <span class="hljs-string">&quot;/tmp/test&quot;</span>  )</code></pre>
<blockquote><p><a href="http://www.runoob.com/python/file-methods.html" target="_blank">http://www.runoob.com/python/file-methods.html</a></p></blockquote><!-- File.md ends here -->



                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Dictionary.html" class="navigation navigation-prev " aria-label="Previous page: Dictionary">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="List.html" class="navigation navigation-next " aria-label="Next page: List">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"File","level":"1.2.2","depth":2,"next":{"title":"List","level":"1.2.3","depth":2,"path":"base/List.md","ref":"base/List.md","articles":[]},"previous":{"title":"Dictionary","level":"1.2.1","depth":2,"path":"base/Dictionary.md","ref":"base/Dictionary.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"base/File.md","mtime":"2017-06-20T14:09:32.035Z","type":"markdown"},"gitbook":{"version":"3.2.0","time":"2017-06-21T15:07:28.910Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

